<?xml version="1.0" ?>
<net name="inception_v3_2016_08_28_frozen" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,299,299"/>
			<output>
				<port id="0" names="input:0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_11378_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,1,1,1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="input/reverse_input_channels20291/Concat20308_const" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="1,3,1,1" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="input/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="input/reverse_input_channels/Concat20300_const" type="Const" version="opset1">
			<data element_type="f32" offset="16" shape="32,3,3,3" size="3456"/>
			<output>
				<port id="0" names="InceptionV3/Conv2d_1a_3x3/weights/read:0" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="InceptionV3/InceptionV3/Conv2d_1a_3x3/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11677_const" type="Const" version="opset1">
			<data element_type="f32" offset="3472" shape="1,32,1,1" size="128"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="InceptionV3/InceptionV3/Conv2d_1a_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Conv2d_1a_3x3/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="InceptionV3/InceptionV3/Conv2d_2a_3x3/convolution/Transpose15431_const" type="Const" version="opset1">
			<data element_type="f32" offset="3600" shape="32,32,3,3" size="36864"/>
			<output>
				<port id="0" names="InceptionV3/Conv2d_2a_3x3/weights/read:0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="InceptionV3/InceptionV3/Conv2d_2a_3x3/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11685_const" type="Const" version="opset1">
			<data element_type="f32" offset="40464" shape="1,32,1,1" size="128"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="InceptionV3/InceptionV3/Conv2d_2a_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Conv2d_2a_3x3/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="InceptionV3/InceptionV3/Conv2d_2b_3x3/convolution/Transpose15435_const" type="Const" version="opset1">
			<data element_type="f32" offset="40592" shape="64,32,3,3" size="73728"/>
			<output>
				<port id="0" names="InceptionV3/Conv2d_2b_3x3/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="InceptionV3/InceptionV3/Conv2d_2b_3x3/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11693_const" type="Const" version="opset1">
			<data element_type="f32" offset="114320" shape="1,64,1,1" size="256"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="InceptionV3/InceptionV3/Conv2d_2b_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Conv2d_2b_3x3/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="3,3" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="InceptionV3/InceptionV3/Conv2d_3b_1x1/convolution/Transpose15439_const" type="Const" version="opset1">
			<data element_type="f32" offset="114576" shape="80,64,1,1" size="20480"/>
			<output>
				<port id="0" names="InceptionV3/Conv2d_3b_1x1/weights/read:0" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="InceptionV3/InceptionV3/Conv2d_3b_1x1/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11701_const" type="Const" version="opset1">
			<data element_type="f32" offset="135056" shape="1,80,1,1" size="320"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="InceptionV3/InceptionV3/Conv2d_3b_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Conv2d_3b_1x1/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="InceptionV3/InceptionV3/Conv2d_4a_3x3/convolution/Transpose15443_const" type="Const" version="opset1">
			<data element_type="f32" offset="135376" shape="192,80,3,3" size="552960"/>
			<output>
				<port id="0" names="InceptionV3/Conv2d_4a_3x3/weights/read:0" precision="FP32">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="InceptionV3/InceptionV3/Conv2d_4a_3x3/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11709_const" type="Const" version="opset1">
			<data element_type="f32" offset="688336" shape="1,192,1,1" size="768"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="InceptionV3/InceptionV3/Conv2d_4a_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Conv2d_4a_3x3/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="3,3" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/convolution/Transpose15447_const" type="Const" version="opset1">
			<data element_type="f32" offset="689104" shape="64,192,1,1" size="49152"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11717_const" type="Const" version="opset1">
			<data element_type="f32" offset="738256" shape="1,64,1,1" size="256"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/convolution/Transpose15451_const" type="Const" version="opset1">
			<data element_type="f32" offset="738512" shape="48,192,1,1" size="36864"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/weights/read:0" precision="FP32">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11725_const" type="Const" version="opset1">
			<data element_type="f32" offset="775376" shape="1,48,1,1" size="192"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/convolution/Transpose15455_const" type="Const" version="opset1">
			<data element_type="f32" offset="775568" shape="64,48,5,5" size="307200"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11733_const" type="Const" version="opset1">
			<data element_type="f32" offset="1082768" shape="1,64,1,1" size="256"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/convolution/Transpose15459_const" type="Const" version="opset1">
			<data element_type="f32" offset="1083024" shape="64,192,1,1" size="49152"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11741_const" type="Const" version="opset1">
			<data element_type="f32" offset="1132176" shape="1,64,1,1" size="256"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/convolution/Transpose15463_const" type="Const" version="opset1">
			<data element_type="f32" offset="1132432" shape="96,64,3,3" size="221184"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/weights/read:0" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11749_const" type="Const" version="opset1">
			<data element_type="f32" offset="1353616" shape="1,96,1,1" size="384"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/convolution/Transpose15467_const" type="Const" version="opset1">
			<data element_type="f32" offset="1354000" shape="96,96,3,3" size="331776"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/weights/read:0" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11757_const" type="Const" version="opset1">
			<data element_type="f32" offset="1685776" shape="1,96,1,1" size="384"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="InceptionV3/InceptionV3/Mixed_5b/Branch_3/AvgPool_0a_3x3/AvgPool" type="AvgPool" version="opset1">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5b/Branch_3/AvgPool_0a_3x3/AvgPool:0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/convolution/Transpose15471_const" type="Const" version="opset1">
			<data element_type="f32" offset="1686160" shape="32,192,1,1" size="24576"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/weights/read:0" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11765_const" type="Const" version="opset1">
			<data element_type="f32" offset="1710736" shape="1,32,1,1" size="128"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="InceptionV3/InceptionV3/Mixed_5b/concat_v2" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="4" names="InceptionV3/InceptionV3/Mixed_5b/concat_v2:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/convolution/Transpose15475_const" type="Const" version="opset1">
			<data element_type="f32" offset="1710864" shape="64,256,1,1" size="65536"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11773_const" type="Const" version="opset1">
			<data element_type="f32" offset="1776400" shape="1,64,1,1" size="256"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/convolution/Transpose15479_const" type="Const" version="opset1">
			<data element_type="f32" offset="1776656" shape="48,256,1,1" size="49152"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/weights/read:0" precision="FP32">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11781_const" type="Const" version="opset1">
			<data element_type="f32" offset="1825808" shape="1,48,1,1" size="192"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/convolution/Transpose15483_const" type="Const" version="opset1">
			<data element_type="f32" offset="1826000" shape="64,48,5,5" size="307200"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11789_const" type="Const" version="opset1">
			<data element_type="f32" offset="2133200" shape="1,64,1,1" size="256"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/convolution/Transpose15487_const" type="Const" version="opset1">
			<data element_type="f32" offset="2133456" shape="64,256,1,1" size="65536"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11797_const" type="Const" version="opset1">
			<data element_type="f32" offset="2198992" shape="1,64,1,1" size="256"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" names="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/convolution/Transpose15491_const" type="Const" version="opset1">
			<data element_type="f32" offset="2199248" shape="96,64,3,3" size="221184"/>
			<output>
				<port id="0" names="InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/weights/read:0" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/sub/EltwiseUnsqueeze11805_const" type="Const" version="opset1">
			<data element_type="f32" offset="2420432" shape="1,96,1,1" size="384"/>
			<output>
				<port id="0" names="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
